Revit 2027 API
MetallicPaint.MetallicpaintFlecksColorByObject Property
 The property labeled "Color By Object" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetallicpaintFlecksColorByObject { get; }
Public Shared ReadOnly Property MetallicpaintFlecksColorByObject As String
	Get
public:
static property String^ MetallicpaintFlecksColorByObject {
	String^ get ();
}
static member MetallicpaintFlecksColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace